Revit 2027 API
ParameterTypeId.ScheduleEmbeddedParam Property
 "Embedded Schedule"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ScheduleEmbeddedParam { get; }
Public Shared ReadOnly Property ScheduleEmbeddedParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ScheduleEmbeddedParam {
	ForgeTypeId^ get ();
}
static member ScheduleEmbeddedParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace